#ifndef __HC_08_H
#define __HC_08_H
/***********************************************************************************************************************************
 **【购买链接】  魔女科技    https://demoboard.taobao.com
 **【更新分享】  Q群文件夹   887199504
 ***********************************************************************************************************************************
 **【文件名称】  HC08.h
 **【文件功能】 
 **
 **【适用平台】  STM32F103 + 标准库v3.5 + keil5
 **
 **【重要说明】  本代码只适合HC-08, 不适合HC-05、HC-06, 
 **              HC-08：默认串口波特率9600
 **              HC-08：连接时，不需要密码；双方名称不一样亦可连接，只要一方为主机模式，另一方为从机模式
 **              HD-08: 连接后，数据发送为透传模式
 **              HC-08: 与手机蓝牙APP通信，APP必须支持BLE协议，另外，手机需打开位置功能(GPS), 否则很难搜索到HC-08设备，重要！重要！重要！
 **              HC-08: 只支持一对一通信，不支持多设备同时连接； 
 **  
 **【移植说明】  1 - 在h文件中修改 HC08_ROLE的值，以配置本设备为主／从设备；
 **              2 - 在h文件中修改所用的USARTx端口；
 **              3 - 检查所用USARTx端口的中断函数，修改功能；
 **
 **
 **【更新记录】  2021-07-02  文件建立
 **              
 **    
************************************************************************************************************************************/
#include <stm32f10x.h>  
#include <stdio.h>
#include "string.h"       // C标准库头文件: 字符数组常用：strcpy()、strncpy()、strcmp()、strlen()、strnset()
#include "usart.h"





/*****************************************************************************
 ** 移植配置
****************************************************************************/
#define HC08_UARTx       USART2
#define HC08_ROLE        0             // 主从模式，0=slave, 1=master；与手机APP互连必须配置为从机模式





/*****************************************************************************
 ** 全局变量 
****************************************************************************/
typedef struct 
{
    uint8_t  flag_UARTConnect;         // 标记：与开发板间的通信是否正常; 0=失败, 1=成功
    uint8_t  flag_TargetConnect;       // 标记：与目标设备通信是否正常；0=失败, 1=成功
}xHC08_TypeDef;

extern xHC08_TypeDef xHC08;            // 声明为全局变量,方便记录信息、状态
    




/*****************************************************************************
 ** 声明全局函数
****************************************************************************/
void  HC08_Init(void);                             // 初始化串口及中断优先、AT参数配置级;
void  HC08_SendData(uint8_t* data, uint16_t cnt);  // 发送指定长度的数据;
void  HC08_SendString(char* strTemp);              // 发送字符串;


#endif

















